[
  {
    "schoolID": 1,
    "school": "Unknown School",
    "category": "Unknown School",
    "summary": "General placeholder for philosophical schools that cannot be clearly classified, are disputed in historical categorization, or lack sufficient data for firm placement.",
    "corePrinciples": "Unspecified principles",
    "keywords": [
      "unspecified",
      "unknown classification",
      "miscellaneous",
      "undefined tradition"
    ]
  },
  {
    "schoolID": 2,
    "school": "Ancient Greek Philosophy",
    "category": "Ancient & Classical",
    "summary": "The foundation of Western philosophy, encompassing pre-Socratic natural philosophers, Socrates’ ethical inquiries, Plato’s theory of forms, and Aristotle’s systematization of logic, metaphysics, politics, and natural sciences. Ancient Greek thought emphasized rational inquiry, virtue ethics, cosmology, and the pursuit of knowledge as the highest human calling.",
    "corePrinciples": "Reason, virtue, pursuit of knowledge, metaphysical inquiry",
    "keywords": [
      "Socrates",
      "Plato",
      "Aristotle",
      "pre-Socratics",
      "virtue ethics",
      "logic",
      "epistemology",
      "cosmos",
      "metaphysics"
    ]
  },
  {
    "schoolID": 3,
    "school": "Stoicism",
    "category": "Ancient & Classical",
    "summary": "Founded by Zeno of Citium in 3rd century BCE Athens, Stoicism emphasizes living in accordance with nature, cultivating virtue as the only true good, and maintaining tranquility through rational self-mastery. Stoics distinguished between what lies within our control (judgments, desires, actions) and what lies beyond (fortune, reputation, death). It greatly influenced Roman thinkers such as Seneca, Epictetus, and Marcus Aurelius and continues to inspire modern practices of resilience.",
    "corePrinciples": "Virtue as the highest good, rational control, acceptance of fate (amor fati)",
    "keywords": [
      "virtue ethics",
      "logos",
      "apatheia",
      "ataraxia",
      "cosmopolitanism",
      "amor fati",
      "Marcus Aurelius",
      "Epictetus",
      "Seneca",
      "Zeno of Citium"
    ]
  },
  {
    "schoolID": 4,
    "school": "Epicureanism",
    "category": "Ancient & Classical",
    "summary": "Founded by Epicurus in the 4th century BCE, Epicureanism taught that the highest good is pleasure, understood not as indulgence but as the absence of pain (aponia) and disturbance (ataraxia). It valued moderation, simple living, friendship, and intellectual contemplation as the path to tranquility. The school challenged superstition and fear of death, arguing that the soul is material and mortal.",
    "corePrinciples": "Moderation, tranquility, friendship, materialism of the soul",
    "keywords": [
      "Epicurus",
      "pleasure",
      "ataraxia",
      "aponia",
      "friendship",
      "materialism",
      "fear",
      "death",
      "hedone"
    ]
  },
  {
    "schoolID": 5,
    "school": "Skepticism",
    "category": "Ancient & Classical",
    "summary": "A philosophical school originating with Pyrrho and later developed by the Academic Skeptics. It questions the possibility of certain knowledge, recommending suspension of judgment (epoché) to attain tranquility. Skeptics argued that for every claim, an opposing claim can be equally defended, thus promoting intellectual humility and freedom from dogmatism.",
    "corePrinciples": "Suspension of judgment, inquiry, doubt, intellectual humility",
    "keywords": [
      "Pyrrho",
      "Sextus",
      "Empiricus",
      "epoché",
      "ataraxia",
      "doubt",
      "intellectual",
      "humility",
      "relativism"
    ]
  },
  {
    "schoolID": 6,
    "school": "Neoplatonism",
    "category": "Ancient & Classical",
    "summary": "A late antique movement rooted in Plato’s metaphysics, founded by Plotinus in the 3rd century CE. It emphasized the One as the ultimate reality, from which emanates Intellect and Soul. Neoplatonism stressed mystical union with the divine through contemplation, influencing early Christian, Islamic, and Jewish thought.",
    "corePrinciples": "Unity, emanation, mystical ascent, contemplation of the One",
    "keywords": [
      "Plotinus",
      "the One",
      "emanation",
      "Nous",
      "Soul",
      "mystical",
      "ascent",
      "Porphyry",
      "Proclus"
    ]
  },
  {
    "schoolID": 7,
    "school": "Cynicism",
    "category": "Ancient & Classical",
    "summary": "Founded by Antisthenes and popularized by Diogenes of Sinope, Cynicism rejected conventional desires for wealth, power, and fame. Cynics advocated living in accordance with nature, practicing radical simplicity, and cultivating virtue free from social constraints. Their provocative lifestyle was meant to expose the emptiness of social conventions.",
    "corePrinciples": "Virtue through simplicity, rejection of convention, living naturally",
    "keywords": [
      "Antisthenes",
      "Diogenes",
      "asceticism",
      "autarkeia",
      "parrhesia",
      "virtue",
      "dog-like living"
    ]
  },
  {
    "schoolID": 8,
    "school": "Scholasticism",
    "category": "Medieval & Religious",
    "summary": "The dominant intellectual tradition of medieval Europe, blending Christian theology with Aristotelian philosophy. Scholastics such as Thomas Aquinas and Anselm used rigorous logic to reconcile faith and reason, exploring metaphysics, ethics, and the nature of God. Scholasticism was characterized by dialectical disputation and systematic theology.",
    "corePrinciples": "Faith and reason, dialectical logic, systematic theology",
    "keywords": [
      "Thomas Aquinas",
      "Anselm",
      "Peter Abelard",
      "logic",
      "dialectic",
      "universals",
      "Summa",
      "Theologica"
    ]
  },
  {
    "schoolID": 9,
    "school": "Islamic Philosophy",
    "category": "Medieval & Religious",
    "summary": "Flourishing from the 8th to 12th centuries, Islamic philosophy integrated Greek thought with Islamic theology. Thinkers like Al-Farabi, Avicenna, and Averroes explored metaphysics, ethics, logic, and the harmony of faith and reason. It significantly influenced medieval Europe and preserved Aristotelian and Platonic traditions.",
    "corePrinciples": "Harmony of reason and revelation, metaphysics, logic, ethics",
    "keywords": [
      "Avicenna",
      "Ibn Sina",
      "Averroes",
      "Ibn Rushd",
      "Al-Farabi",
      "Al-Ghazali",
      "metaphysics",
      "cosmology",
      "faith",
      "reason"
    ]
  },
  {
    "schoolID": 10,
    "school": "Jewish Philosophy",
    "category": "Medieval & Religious",
    "summary": "Blending Jewish theology with philosophy, this tradition drew upon Islamic and Christian thinkers while remaining rooted in Hebrew scripture. Figures like Philo, Maimonides, and Spinoza explored divine law, ethics, and metaphysics. It developed concepts of rational theology and the nature of God’s attributes.",
    "corePrinciples": "Rational theology, divine law, ethics, reconciliation of faith and reason",
    "keywords": [
      "Philo of Alexandria",
      "Maimonides",
      "Spinoza",
      "ethics",
      "Torah",
      "divine",
      "attributes",
      "reason",
      "revelation"
    ]
  },
  {
    "schoolID": 11,
    "school": "Rationalism",
    "category": "Modern Era",
    "summary": "A 17th-century philosophical movement holding that reason and innate ideas are the primary sources of knowledge. Key figures include Descartes, Spinoza, and Leibniz, who used deductive reasoning to construct systems of metaphysics and epistemology, often in contrast to empiricism.",
    "corePrinciples": "Reason as foundation of knowledge, innate ideas, deductive logic",
    "keywords": [
      "Descartes",
      "Spinoza",
      "Leibniz",
      "innate ideas",
      "deduction",
      "clear",
      "distinct",
      "perceptions"
    ]
  },
  {
    "schoolID": 12,
    "school": "Empiricism",
    "category": "Modern Era",
    "summary": "Developed in the 17th and 18th centuries, empiricism emphasizes experience and sensory perception as the foundation of knowledge. Thinkers such as Locke, Berkeley, and Hume argued that the mind is shaped by impressions and ideas derived from observation, often opposing rationalist claims of innate ideas.",
    "corePrinciples": "Experience as knowledge, sensory data, observation, induction",
    "keywords": [
      "John Locke",
      "George Berkeley",
      "David Hume",
      "tabula rasa",
      "perception",
      "induction"
    ]
  },
  {
    "schoolID": 13,
    "school": "Humanism",
    "category": "Modern Era",
    "summary": "Renaissance and modern movement emphasizing human dignity, reason, and secular ethics. Humanists turned to classical texts and celebrated human creativity, autonomy, and potential for self-realization. In the modern period, humanism expanded into a secular worldview advocating science, democracy, and individual rights.",
    "corePrinciples": "Human dignity, secular ethics, individual autonomy, classical revival",
    "keywords": [
      "Erasmus",
      "Pico della Mirandola",
      "Renaissance",
      "secular",
      "ethics",
      "education",
      "individual",
      "autonomy",
      "self-realization",
      "democracy",
      "science",
      "individual",
      "rights"
    ]
  },
  {
    "schoolID": 14,
    "school": "German Idealism",
    "category": "Modern Era",
    "summary": "A post-Kantian movement emphasizing the active role of the mind in constituting reality. Fichte, Schelling, and Hegel developed systems of metaphysics and epistemology stressing self-consciousness, freedom, and the dialectical unfolding of Spirit.",
    "corePrinciples": "Mind as constitutive of reality, self-consciousness, dialectic, synthesis",
    "keywords": [
      "Kant",
      "Fichte",
      "Schelling",
      "Hegel",
      "dialectic",
      "self-consciousness",
      "Absolute Spirit"
    ]
  },
  {
    "schoolID": 15,
    "school": "Utilitarianism",
    "category": "Modern Era",
    "summary": "An ethical theory developed by Jeremy Bentham and John Stuart Mill, holding that the morally right action is that which produces the greatest happiness for the greatest number. It grounds morality in consequences rather than intentions, influencing modern social and political thought.",
    "corePrinciples": "Greatest happiness principle, consequentialism, utility",
    "keywords": [
      "Bentham",
      "Mill",
      "consequentialism",
      "happiness",
      "utility",
      "pleasure",
      "pain",
      "calculus"
    ]
  },
  {
    "schoolID": 16,
    "school": "Transcendentalism",
    "category": "Modern Era",
    "summary": "A 19th-century American philosophical and literary movement associated with Ralph Waldo Emerson and Henry David Thoreau. It emphasized the inherent goodness of humans and nature, individual intuition over tradition, and self-reliance. Transcendentalism blended idealism with a spiritual respect for nature and became foundational to American Romanticism.",
    "corePrinciples": "Self-reliance, intuition, harmony with nature, spiritual individualism",
    "keywords": [
      "Emerson",
      "Thoreau",
      "nature",
      "intuition",
      "self-reliance",
      "American",
      "Romanticism"
    ]
  },
  {
    "schoolID": 17,
    "school": "Analytic Philosophy",
    "category": "Contemporary",
    "summary": "Emerging in the late 19th and early 20th centuries, analytic philosophy emphasizes clarity, logical rigor, and precision in language. Developed by Frege, Russell, and Moore, it evolved through logical positivism, ordinary language philosophy, and philosophy of science. Today it spans epistemology, metaphysics, ethics, and philosophy of mind.",
    "corePrinciples": "Logical clarity, linguistic analysis, rigorous argument, scientific orientation",
    "keywords": [
      "Frege",
      "Russell",
      "Moore",
      "logical",
      "positivism",
      "ordinary",
      "language",
      "Wittgenstein",
      "semantics",
      "epistemology",
      "metaphysics"
    ]
  },
  {
    "schoolID": 18,
    "school": "Continental Philosophy",
    "category": "Contemporary",
    "summary": "A broad 19th and 20th-century tradition distinct from analytic philosophy, encompassing existentialism, phenomenology, hermeneutics, structuralism, post-structuralism, and critical theory. Continental philosophy often emphasizes history, culture, subjectivity, and social critique over formal analysis.",
    "corePrinciples": "Historical context, critique of modernity, subjectivity, interpretation",
    "keywords": [
      "Heidegger",
      "Sartre",
      "Merleau-Ponty",
      "Foucault",
      "Derrida",
      "Gadamer",
      "Nietzsche",
      "hermeneutics",
      "deconstruction"
    ]
  },
  {
    "schoolID": 19,
    "school": "Existentialism",
    "category": "Contemporary",
    "summary": "Existentialism emphasizes individual freedom, authenticity, and meaning-making in an indifferent or absurd universe. Kierkegaard highlighted faith and authenticity, Nietzsche proclaimed the death of God and will to power, Sartre emphasized radical freedom and responsibility, while Camus explored the absurd. It influenced literature, psychology, and theology.",
    "corePrinciples": "Freedom, authenticity, responsibility, meaning-making",
    "keywords": [
      "Kierkegaard",
      "Nietzsche",
      "Sartre",
      "Camus",
      "authenticity",
      "bad faith",
      "alienation",
      "absurd",
      "existence",
      "precedes",
      "essence"
    ]
  },
  {
    "schoolID": 20,
    "school": "Absurdism",
    "category": "Contemporary",
    "summary": "An outgrowth of existentialism most associated with Albert Camus. Absurdism holds that human beings seek inherent meaning in life, but the universe offers none. The confrontation between this desire and meaninglessness creates the absurd, which can only be faced with rebellion, freedom, and personal meaning-making.",
    "corePrinciples": "Confronting meaninglessness, rebellion, freedom, personal responsibility",
    "keywords": [
      "Camus",
      "Myth",
      "Sisyphus",
      "absurd",
      "revolt",
      "freedom",
      "personal",
      "responsibility",
      "meaning-making"
    ]
  },
  {
    "schoolID": 21,
    "school": "Phenomenology",
    "category": "Contemporary",
    "summary": "Founded by Edmund Husserl, phenomenology studies the structures of conscious experience and intentionality. Heidegger expanded it into existential ontology, while Merleau-Ponty focused on embodiment. Phenomenology emphasizes bracketing presuppositions to describe the essence of phenomena.",
    "corePrinciples": "Intentionality, lived experience, essences, bracketing (epoché)",
    "keywords": [
      "Husserl",
      "Heidegger",
      "Merleau-Ponty",
      "intentionality",
      "lifeworld",
      "noesis",
      "noema"
    ]
  },
  {
    "schoolID": 22,
    "school": "Pragmatism",
    "category": "Contemporary",
    "summary": "An American philosophical movement pioneered by Charles Sanders Peirce, William James, and John Dewey. Pragmatism evaluates ideas and beliefs based on their practical effects and usefulness in guiding action. Truth is seen as dynamic and tied to what works in lived experience, making pragmatism influential in philosophy of science, education, and democratic theory.",
    "corePrinciples": "Truth as utility, practicality, experimentation, fallibilism",
    "keywords": [
      "Peirce",
      "James",
      "Dewey",
      "pragmatism",
      "practicality",
      "experimentation",
      "fallibilism"
    ]
  },
  {
    "schoolID": 23,
    "school": "Marxism",
    "category": "Contemporary",
    "summary": "Developed by Karl Marx and Friedrich Engels, Marxism is both a social theory and political movement. It analyzes society in terms of class struggle, modes of production, and historical materialism. Marxism emphasizes the role of economic structures in shaping ideology, politics, and culture, and calls for revolutionary change toward a classless, communist society.",
    "corePrinciples": "Historical materialism, class struggle, critique of capitalism, communism",
    "keywords": [
      "Karl Marx",
      "Friedrich Engels",
      "dialectical",
      "materialism",
      "class struggle",
      "capitalism",
      "communism",
      "alienation",
      "proletariat",
      "bourgeoisie"
    ]
  },
  {
    "schoolID": 24,
    "school": "Critical Theory",
    "category": "Contemporary",
    "summary": "Originating with the Frankfurt School, critical theory critiques society, culture, and ideology with the aim of emancipation from domination. Thinkers such as Adorno, Horkheimer, Marcuse, and later Habermas interrogated capitalism, modernity, mass culture, and communication. It emphasizes self-reflection, power dynamics, and the need for social transformation.",
    "corePrinciples": "Emancipation, critique of ideology, social transformation, power analysis",
    "keywords": [
      "Frankfurt School",
      "Adorno",
      "Horkheimer",
      "Marcuse",
      "Habermas",
      "critical",
      "theory",
      "ideology",
      "emancipation",
      "mass",
      "culture"
    ]
  },
  {
    "schoolID": 25,
    "school": "Post-structuralism",
    "category": "Contemporary",
    "summary": "Emerging in the mid-20th century as a reaction to structuralism, post-structuralism questions stable structures of meaning, emphasizing the fluidity of language, subjectivity, and power. Thinkers like Foucault, Derrida, and Deleuze challenged essentialist categories, truth claims, and fixed interpretations, favoring deconstruction and genealogical critique.",
    "corePrinciples": "Deconstruction, instability of meaning, critique of power, anti-essentialism",
    "keywords": [
      "Foucault",
      "Derrida",
      "Deleuze",
      "genealogy",
      "deconstruction",
      "discourse",
      "subjectivity",
      "power",
      "relations"
    ]
  },
  {
    "schoolID": 26,
    "school": "Structuralism",
    "category": "Contemporary",
    "summary": "A mid-20th-century intellectual movement influenced by linguistics and anthropology. Structuralism analyzes human culture, language, and thought in terms of underlying structures. Figures such as Saussure, Lévi-Strauss, and Lacan emphasized systems, relations, and codes over individual meaning.",
    "corePrinciples": "Structures over individuals, language systems, cultural codes, relational meaning",
    "keywords": [
      "Saussure",
      "Lévi-Strauss",
      "Lacan",
      "semiotics",
      "signifier",
      "signified",
      "myth",
      "structure"
    ]
  },
  {
    "schoolID": 27,
    "school": "Hermeneutics",
    "category": "Contemporary",
    "summary": "The art and theory of interpretation, originating in biblical and legal traditions but expanded to philosophy by Schleiermacher, Dilthey, Gadamer, and Ricoeur. Hermeneutics emphasizes the historical and linguistic conditions of understanding, the hermeneutic circle, and dialogue between interpreter and text.",
    "corePrinciples": "Interpretation, historical context, hermeneutic circle, dialogical understanding",
    "keywords": [
      "Schleiermacher",
      "Dilthey",
      "Gadamer",
      "Ricoeur",
      "interpretation",
      "hermeneutic",
      "circle",
      "text",
      "understanding"
    ]
  },
  {
    "schoolID": 28,
    "school": "Postmodernism",
    "category": "Contemporary",
    "summary": "A late 20th-century movement skeptical of grand narratives, objective truths, and universal reason. Postmodernism emphasizes pluralism, cultural relativism, irony, and the play of meaning. Thinkers like Lyotard, Baudrillard, and Jameson explored themes of simulation, consumer culture, and the fragmentation of identity.",
    "corePrinciples": "Skepticism of meta-narratives, relativism, pluralism, critique of modernity",
    "keywords": [
      "Lyotard",
      "Baudrillard",
      "Jameson",
      "meta-narratives",
      "relativism",
      "pluralism",
      "simulation",
      "identity"
    ]
  },
  {
    "schoolID": 29,
    "school": "Feminist Philosophy",
    "category": "Contemporary",
    "summary": "A diverse movement addressing the philosophical implications of gender, power, and social justice. Feminist philosophy critiques patriarchal assumptions in epistemology, ethics, and metaphysics, and develops alternatives centered on care, relationality, and equality. Thinkers include Simone de Beauvoir, Judith Butler, and bell hooks.",
    "corePrinciples": "Gender analysis, equality, critique of patriarchy, relational ethics",
    "keywords": [
      "Simone de Beauvoir",
      "Judith Butler",
      "bell",
      "hooks",
      "patriarchy",
      "gender",
      "theory",
      "intersectionality",
      "care ethics"
    ]
  },
  {
    "schoolID": 30,
    "school": "Postcolonial Philosophy",
    "category": "Contemporary",
    "summary": "Postcolonial philosophy critiques the legacy of colonialism and imperialism in shaping knowledge, identity, and culture. Thinkers such as Edward Said, Homi Bhabha, and Gayatri Spivak analyze hybridity, representation, and the power dynamics of East/West relations, advocating for decolonization of thought and institutions.",
    "corePrinciples": "Decolonization, critique of imperialism, hybridity, representation, cultural identity",
    "keywords": [
      "Edward Said",
      "Homi Bhabha",
      "Spivak",
      "Orientalism",
      "hybridity",
      "representation",
      "decolonization"
    ]
  },
  {
    "schoolID": 31,
    "school": "Process Philosophy",
    "category": "Contemporary",
    "summary": "Developed by Alfred North Whitehead and Charles Hartshorne, process philosophy emphasizes becoming, change, and relationality over static being. It sees reality as a network of interrelated events and processes rather than substances. It has influenced theology, metaphysics, and environmental thought.",
    "corePrinciples": "Becoming over being, relational ontology, process metaphysics, creativity",
    "keywords": [
      "Whitehead",
      "Hartshorne",
      "process",
      "becoming",
      "events",
      "relational ontology",
      "creativity"
    ]
  },
  {
    "schoolID": 32,
    "school": "Environmental Philosophy",
    "category": "Contemporary",
    "summary": "Environmental philosophy examines the ethical, metaphysical, and social dimensions of human interaction with nature. It includes deep ecology, ecofeminism, and sustainability ethics, emphasizing the intrinsic value of nature and the moral responsibility to protect ecosystems.",
    "corePrinciples": "Ecocentrism, intrinsic value of nature, sustainability, ecological responsibility",
    "keywords": [
      "deep",
      "ecology",
      "eco-ethics",
      "sustainability",
      "ecofeminism",
      "intrinsic",
      "value",
      "environmental ethics"
    ]
  },
  {
    "schoolID": 33,
    "school": "Posthumanism",
    "category": "Contemporary",
    "summary": "A philosophical perspective questioning human-centered frameworks, emphasizing the decentering of the human in favor of networks of humans, technology, animals, and environment. Posthumanism explores transhumanism, AI ethics, and ecological interconnectedness.",
    "corePrinciples": "Decentering the human, technology integration, ecological and species interconnectedness",
    "keywords": [
      "transhumanism",
      "AI",
      "ethics",
      "Artificial",
      "Intelligence",
      "theory",
      "Haraway",
      "ecology",
      "nonhuman",
      "agency"
    ]
  },
  {
    "schoolID": 34,
    "school": "Deconstruction",
    "category": "Contemporary",
    "summary": "Developed by Jacques Derrida, deconstruction is a method of textual analysis that exposes internal contradictions and instabilities in meaning. It undermines binary oppositions (such as presence/absence, speech/writing) and highlights the play of différance in language.",
    "corePrinciples": "Instability of meaning, critique of binaries, textual play, différance",
    "keywords": [
      "Derrida",
      "différance",
      "binary",
      "opposition",
      "logocentrism",
      "textual",
      "analysis"
    ]
  },
  {
    "schoolID": 35,
    "school": "Practical Philosophy",
    "category": "Applied Philosophy",
    "summary": "An orientation that applies philosophical methods and reasoning to everyday problems and social issues. Practical philosophy engages with ethics, politics, education, and personal life, emphasizing wisdom as lived practice rather than abstract theory.",
    "corePrinciples": "Application of philosophy, ethical living, wisdom in practice",
    "keywords": [
      "applied",
      "ethics",
      "politics",
      "education",
      "practical",
      "reasoning",
      "wisdom"
    ]
  },
  {
    "schoolID": 36,
    "school": "Philosophy of Technology",
    "category": "Applied Philosophy",
    "summary": "A contemporary branch exploring the nature of technology, its impact on society, and the ethical implications of technological change. Thinkers such as Heidegger, Don Ihde, and Bernard Stiegler analyze how technology shapes human existence, perception, and power structures.",
    "corePrinciples": "Critique of technology, human-technology relation, ethics of innovation",
    "keywords": [
      "Heidegger",
      "Stiegler",
      "Don Ihde",
      "technology",
      "ethics",
      "artificial",
      "intelligence",
      "cybernetics",
      "innovation"
    ]
  }
]
