{
    "author_bibliography": {
      "author": "David Hume",
      "birth_death": "1711 - 1776",
      "description": "David Hume was a Scottish Enlightenment philosopher, historian, economist, and essayist, widely regarded as one of the most important figures in Western philosophy. His work fundamentally shaped modern thought in epistemology, metaphysics, ethics, political theory, and the philosophy of religion. Hume's radical empiricism, skepticism about causation, critique of miracles, and naturalistic view of human understanding challenged centuries of philosophical orthodoxy and influenced generations of thinkers, including Kant, Darwin, and modern empiricists. His bibliography includes major philosophical treatises, more accessible essays, and significant historical writings.",
      "background": "Born in Edinburgh, Scotland, David Hume was a precocious thinker who left university at the age of 15 to pursue a rigorous program of self-study. He experienced a profound 'philosophical crisis' in his youth, which fueled his lifetime dedication to understanding the nature of human cognition, morality, and belief. Though often at odds with religious institutions and initially met with hostility by academic elites, Hume became highly influential through his prose style, intellectual rigor, and wide-ranging interests. His later life was marked by success as an historian and political essayist, though his philosophical writings eventually came to define his legacy.",
      "works": [
        {
          "title": "A Treatise of Human Nature",
          "original_title": "A Treatise of Human Nature: Being an Attempt to Introduce the Experimental Method of Reasoning into Moral Subjects",
          "year": 1739,
          "type": "Philosophical Treatise",
          "summary": "Hume’s most ambitious and foundational work, the 'Treatise' attempts to build a science of human nature grounded in empirical observation. It is divided into three books: 'Of the Understanding', where he develops his theory of impressions and ideas, causation, and the limits of reason; 'Of the Passions', where he explores human emotion and motivation; and 'Of Morals', where he lays the groundwork for his sentimentalist ethics. The book was largely ignored at the time of publication but later hailed as a philosophical masterpiece."
        },
        {
          "title": "An Enquiry Concerning Human Understanding",
          "original_title": "Philosophical Essays Concerning Human Understanding",
          "year": 1748,
          "type": "Philosophical Treatise (Revised Summary of the Treatise)",
          "summary": "A more concise and accessible restatement of the key arguments from the 'Treatise', this work includes Hume’s famous analysis of cause and effect, his argument against the rational justification of induction, and his critique of miracles. The Enquiry also introduces the 'missing shade of blue' thought experiment and frames Hume's empiricism in a clearer and more digestible style. It became one of his most influential works and is considered essential reading in epistemology."
        },
        {
          "title": "An Enquiry Concerning the Principles of Morals",
          "original_title": "An Enquiry Concerning the Principles of Morals",
          "year": 1751,
          "type": "Philosophical Treatise (Ethics)",
          "summary": "Hume's second Enquiry focuses entirely on ethics and is more optimistic in tone than his earlier work. He defends a moral philosophy based on human sentiment, emphasizing virtues like benevolence and justice as rooted in feelings rather than rational deduction. Hume argues that utility and sympathy form the basis of our moral judgments. He regarded this book as his most successful philosophical work."
        },
        {
          "title": "Dialogues Concerning Natural Religion",
          "original_title": "Dialogues Concerning Natural Religion",
          "year": 1779,
          "type": "Philosophical Dialogue",
          "summary": "Published posthumously, this dialogue pits three fictional characters—Demea, Philo, and Cleanthes—against each other in a discussion on the nature and existence of God. Through the skeptical character Philo, Hume raises powerful objections to the teleological and cosmological arguments for God's existence, and subtly critiques the problem of evil. The work is a masterclass in philosophical dialogue and is among the most sophisticated critiques of natural theology ever written."
        },
        {
          "title": "The Natural History of Religion",
          "original_title": "The Natural History of Religion",
          "year": 1757,
          "type": "Philosophical Essay (Anthropology of Religion)",
          "summary": "This essay explores the origins and evolution of religious belief, arguing that polytheism preceded monotheism and that religion arose from human fear and the tendency to anthropomorphize nature. Hume explains religion through psychological and sociological factors rather than metaphysical truth claims. It reflects his broader project to analyze belief through the lens of natural human experience."
        },
        {
          "title": "Essays, Moral, Political, and Literary",
          "original_title": "Essays, Moral, Political, and Literary",
          "year": "1741-1777",
          "type": "Collection of Essays",
          "summary": "These essays cover a vast range of topics, from economics and politics to aesthetics and morality. Hume articulates principles of free trade, constitutional government, and civic virtue, and critiques enthusiasm and superstition in religion. The essays helped build Hume's public reputation and demonstrate his practical and accessible prose style. They also reveal the breadth of his intellectual interests beyond technical philosophy."
        },
        {
          "title": "History of England",
          "original_title": "The History of England, from the Invasion of Julius Caesar to the Revolution in 1688",
          "year": "1754-1762",
          "type": "Historical Work (Six Volumes)",
          "summary": "This monumental work, spanning six volumes, was the most popular history book in 18th-century Britain and brought Hume widespread fame during his lifetime. Unlike other histories of the period, Hume’s account was known for its narrative elegance, philosophical analysis of events, and skepticism of religious motives in politics. Although later overshadowed by his philosophical work, the 'History of England' was instrumental in shaping public discourse in the Enlightenment era."
        },
        {
          "title": "An Abstract of a Book Lately Published",
          "original_title": "An Abstract of a Book Lately Published: Entitled A Treatise of Human Nature",
          "year": 1740,
          "type": "Philosophical Summary",
          "summary": "This brief publication was Hume’s own attempt to generate interest in his Treatise by summarizing its core arguments in a clearer and more digestible form. It distills the essence of Hume’s empiricism, including his views on ideas, impressions, belief, and moral sentiment. Though little-known today, it offers insight into how Hume hoped to frame his philosophical project to a skeptical public."
        }
      ]
    }
  }
  