{
    "author": "David Hume",
    "category": "Aphorisms",
    "subject": 
    [
    {
      "theme": "Human Nature",
      "keywords" [

      ],

      "aphorisms": [
        "Man is a bundle of perceptions.",
        "Reason is, and ought only to be the slave of the passions.",
        "Custom is the great guide of human life.",
        "The mind is a kind of theater, where several perceptions make their appearance.",
        "There is no self beyond the collection of experiences.",
        "Our understanding is the copy of our impressions.",
        "No man ever threw away life while it was worth keeping.",
        "The identity which we ascribe to the mind of man is only a fictitious one.",
        "We are more influenced by imagination than by reason.",
        "The will is determined by the strongest motive."
      ]
    },
    {
      "theme": "Epistemology and Knowledge",
      "keywords" [

      ],

      "aphorisms": [
        "A wise man proportions his belief to the evidence.",
        "All knowledge degenerates into probability.",
        "There is no idea in metaphysics more obscure and uncertain than necessary connection.",
        "All reasoning concerning matters of fact seem to be founded on the relation of cause and effect.",
        "The belief in causality arises from habit, not reason.",
        "We can never discover ultimate connections between objects.",
        "All knowledge resolves itself into experience.",
        "The future resembles the past, not by necessity, but by habit.",
        "It is not contrary to reason to prefer the destruction of the world to the scratching of my finger.",
        "The rules of morality are not conclusions of our reason."
      ]
    },
    {
      "Morality and Ethics": [
        "Moral distinctions are not derived from reason.",
        "Virtue is whatever is useful or agreeable to oneself or to others.",
        "Sympathy is the foundation of moral sentiment.",
        "The end of all moral speculations is to teach us our duty and the means of attaining happiness.",
        "Reason alone can never produce any action.",
        "Vice and virtue are perceptions in the mind.",
        "Morals excite passions, and produce or prevent actions.",
        "Nothing can be more real, or concern us more than our sentiments of approbation or blame.",
        "Justice is not derived from nature, but from artificial conventions.",
        "The sense of duty arises from the sentiment of humanity."
      ],
      "Skepticism and Philosophy": [
        "A true skeptic is one who is content to doubt.",
        "The most perfect philosophy of the natural kind only staves off our ignorance a little longer.",
        "If we take in our hand any volume of divinity or metaphysics... commit it then to the flames.",
        "The great subverter of Pyrrhonism is action.",
        "Philosophy would render us entirely Pyrrhonian, were not nature too strong for it.",
        "All belief arises from a species of feeling.",
        "We speak always and never think.",
        "Be a philosopher, but amidst all your philosophy, be still a man.",
        "Even the most rigorous skeptic must live by habit.",
        "Philosophy is an antidote to superstition, not a source of certainty."
      ],
      "Religion and Theology": [
        "A miracle is a violation of the laws of nature.",
        "It is more probable that testimony is false than that nature is violated.",
        "The wise man, therefore, proportions his belief to the evidence.",
        "Religious belief arises not from reason, but from fear and ignorance.",
        "Every religion is founded on faith, not reason.",
        "We are never to expect any extraordinary event unless the proof of it be superior to that of the uniformity of experience.",
        "God's attributes are so removed from human comprehension that they become meaningless.",
        "It is not reason which engenders faith, but rather hope, fear, and imagination.",
        "Nothing is more dangerous to reason than the flights of religious imagination.",
        "We can never prove the existence of God through reason alone."
      ],
      "Politics and Society": [
        "Liberty is the perfection of civil society.",
        "Nothing is more dangerous to reason than men in crowds.",
        "It is seldom that liberty of any kind is lost all at once.",
        "The laws of a nation should be adapted to its manners and customs.",
        "Public interest is often sacrificed to private passion.",
        "Absolute power corrupts the morals of both the ruler and the ruled.",
        "The origin of government is a convention for mutual advantage.",
        "The people are the source of all just power.",
        "Tyranny can arise under the guise of legality.",
        "A populace must be virtuous for liberty to endure."
      ],
      "Aesthetics and Taste": [
        "Beauty in things exists merely in the mind which contemplates them.",
        "A delicacy of taste is a great advantage.",
        "Rules of art are founded on experience and observation.",
        "Taste is not disputable, yet it can be cultivated.",
        "True eloquence consists in saying all that is necessary, and nothing but what is necessary.",
        "The standard of taste is not absolute but found in common sentiment.",
        "The imagination bestows value upon beauty.",
        "Wherever we meet a man of taste, we meet a man of humanity.",
        "Genius can be recognized only by those who have cultivated judgment.",
        "Even in aesthetics, habit and custom have strong influence."
      ],
      "Custom and Habit": [
        "Custom is the great guide of human life.",
        "Nothing is more requisite for success than conformity to common practice.",
        "Habitual impressions determine belief more than evidence.",
        "The mind naturally follows the path of least resistance.",
        "We are creatures of custom, not reason.",
        "Belief is the result of repeated impressions.",
        "Custom reconciles us to everything.",
        "All our reasonings concerning matters of fact are founded on custom, not logic.",
        "The power of habit is the basis of human understanding.",
        "Even the principles of geometry lose their force when habit is against them."
      ],
      "Passions and Emotions": [
        "All human actions are the result of the passions.",
        "The calm passions have a greater influence than is commonly believed.",
        "Pride and humility arise from the comparison of ourselves to others.",
        "Desire is not governed by reason.",
        "Our emotions are often governed by relations of ideas rather than realities.",
        "The sentiment of sympathy makes the misfortune of others our own.",
        "Fear and hope are the most powerful passions.",
        "We often mistake emotional reactions for rational judgment.",
        "Passions can neither be called true nor false.",
        "The control of passions is the foundation of character."
      ]
    }
  }
  