{
    "author": "Friedrich Wilhelm Nietzsche",
    "category": "Aphorisms",
    "subject": [
      {
        "theme": "Truth and Knowledge",
        "keywords": [
          "truth",
          "knowledge",
          "interpretation",
          "convictions",
          "illusion",
          "untruth",
          "life",
          "opinion",
          "reason"
        ],
        "aphorisms": [
          "There are no facts, only interpretations.",
          "Convictions are more dangerous enemies of truth than lies.",
          "Sometimes people do not want to hear the truth because they don't want their illusions destroyed.",
          "To recognize untruth as a condition of life: that is to dare to see life as it is.",
          "Every deep thinker is more afraid of being understood than of being misunderstood.",
          "The truth is ugly: we possess art lest we perish of the truth.",
          "Faith means not wanting to know what is true.",
          "It is hard enough to remember my opinions, without also remembering my reasons for them.",
          "One should never cease in the search for truth—yet know it is a mask."
        ]
      },
      {
        "theme": "Morality and Values",
        "keywords": [
          "morality",
          "values",
          "herd",
          "instinct",
          "individual",
          "right way",
          "despise",
          "emotions",
          "moral",
          "phenomena",
          "interpretations"
        ],
        "aphorisms": [
          "Morality is the herd instinct in the individual.",
          "You have your way. I have my way. The right way does not exist.",
          "He who despises himself still respects himself as one who despises.",
          "All morality is but a sign language of the emotions.",
          "There are no moral phenomena at all, only moral interpretations.",
          "To judge is to impose one's will upon existence.",
          "What is good? All that heightens the feeling of power, the will to power.",
          "What is bad? All that proceeds from weakness.",
          "Virtues are a mask for fear."
        ]
      },
      {
        "theme": "Will to Power",
        "keywords": [
          "will",
          "power",
          "happiness",
          "world",
          "dominate",
          "love",
          "possess"
        ],
        "aphorisms": [
        "To live is to will to power.",
        "What is happiness? The feeling that power is growing.",
        "The world itself is the will to power—and nothing besides!",
        "Every living being is an expression of the will to dominate.",
        "Even love is the will to possess.",
        "You desire freedom? It is but the longing to command."
        ]
      },
      {
        "theme": "Eternal Recurrence",
        "keywords": [
          "eternal",
          "recurrence",
          "demon",
          "life",
          "fate",
          "same"
        ],
        "aphorisms": [
        "What if a demon were to say: this life you must live again and again?",
        "The greatest weight: eternal recurrence of the same.",
        "Would you embrace your fate, eternally repeated?"
      ]
      },
      {
        "theme": "Übermensch",
        "keywords": [
          "übermensch",
          "man",
          "something",
          "shall",
          "overcome",
          "great",
          "bridge",
          "goal",
          "chaos",
          "dancing",
          "star",
          "overman",
          "earth"
        ],
        "aphorisms": [
        "Man is something that shall be overcome.",
        "What is great in man is that he is a bridge and not a goal.",
        "One must still have chaos in oneself to give birth to a dancing star.",
        "The overman is the meaning of the earth."
      ]
      },
      {
        "theme": "Suffering and Strength",
        "keywords": [
          "suffering",
          "strength",
          "snake",
          "skin",
          "perishes",
          "why",
          "live",
          "how",
          "pain",
          "objection",
          "life",
          "stimulant"
        ],
        "aphorisms": [
        "What does not kill me makes me stronger.",
        "To live is to suffer, to survive is to find meaning in suffering.",
        "The snake that cannot shed its skin perishes.",
        "He who has a why to live can bear almost any how.",
        "Pain is not an objection to life; it is its stimulant.",
        "The discipline of suffering creates greatness."
      ]
      },
      {
        "theme": "Nihilism",
        "keywords": [
          "nihilism",
          "god",
          "dead",
          "remains",
          "killed",
          "monster",
          "gaze",
          "abyss",
          "disturbing",
          "guest",
          "humanity",
          "harbored"
        ],
        "aphorisms": [
        "God is dead. God remains dead. And we have killed him.",
        "He who fights with monsters should look to it that he himself does not become a monster.",
        "When you gaze long into an abyss, the abyss also gazes into you.",
        "Nihilism is the most disturbing guest humanity has ever harbored."
      ]
      },
      {
        "theme": "Art and Aesthetics",
        "keywords": [
          "art",
          "aesthetics",
          "music",
          "life",
          "truth",
          "gratitude",
          "highest",
          "task",
          "metaphysical",
          "activity",
          "life"
        ],
        "aphorisms": [
        "Without music, life would be a mistake.",
        "We have art in order not to die of the truth.",
        "The essence of all beautiful art is gratitude.",
        "Art is the highest task and the truly metaphysical activity of life."
      ]
      },
      {
        "theme": "Life and Existence",
        "keywords": [
          "life",
          "existence",
          "dangerous",
          "value",
          "artist",
          "soar",
          "smaller",
          "appear",
          "fly"
        ],
        "aphorisms": [
        "Live dangerously!",
        "One must give value to their existence by behaving as if one’s very existence were a work of art.",
        "Become who you are.",
        "To live is to suffer, to survive is to find some meaning in the suffering.",
        "No artist tolerates reality.",
        "The higher we soar, the smaller we appear to those who cannot fly."
      ]
      },
      {
        "theme": "Miscellaneous",
        "keywords": [
          "miscellaneous",
          "insanity",
          "groups",
          "parties",
          "nations",
          "epochs",
          "rule",
          "forgetful",
          "blunders",
          "predict",
          "future",
          "shape",
          "idleness",
          "psychology",
          "youth",
          "corrupt",
          "instruct",
          "esteem",
          "think",
          "differently"
        ],
        "aphorisms": [
        "In individuals, insanity is rare; but in groups, parties, nations, and epochs, it is the rule.",
        "Blessed are the forgetful, for they get the better even of their blunders.",
        "To predict the future is to shape it.",
        "Idleness is the beginning of all psychology.",
        "The surest way to corrupt a youth is to instruct him to hold in higher esteem those who think alike than those who think differently."
      ]
    }
  ]
}