{
    "author": "Hannah Arendt",
    "category": "Aphorisms",
    "subject": [
      {
        "theme": "Totalitarianism and Evil",
        "keywords": ["totalitarianism", "evil", "banality of evil", "power", "violence"],
        "aphorisms": [
          "Evil is not always monstrous; it is often banal.",
          "Totalitarianism destroys the space between men where freedom appears.",
          "The banality of evil lies in thoughtlessness, not in demonic intent.",
          "When ideology becomes reality, individuality disappears.",
          "Evil thrives where men refuse to think."
        ]
      },
      {
        "theme": "Freedom and Action",
        "keywords": ["freedom", "action", "politics", "plurality", "initiative"],
        "aphorisms": [
          "Freedom is experienced only in the act of beginning something new.",
          "To act is to take the risk of revealing oneself to others.",
          "Human plurality is the condition of freedom.",
          "Action, unlike labor or work, leaves unpredictable consequences.",
          "Freedom requires a public space where words and deeds can appear."
        ]
      },
      {
        "theme": "Thinking and Judgment",
        "keywords": ["thinking", "judgment", "conscience", "responsibility", "reason"],
        "aphorisms": [
          "Thinking interrupts the automatism of action.",
          "Judgment begins where rules end.",
          "Conscience is the silent dialogue with oneself.",
          "The refusal to think is the root of irresponsibility.",
          "True judgment is never detached, but rooted in experience."
        ]
      },
      {
        "theme": "Labor, Work, and Action",
        "keywords": ["labor", "work", "action", "human condition", "vita activa"],
        "aphorisms": [
          "Labor sustains life, work builds a world, and action reveals who we are.",
          "The human condition is defined by labor, work, and action.",
          "Work gives the world permanence; labor gives it necessity.",
          "Only action discloses individuality.",
          "Without action, the world becomes mute and lifeless."
        ]
      },
      {
        "theme": "Power and Violence",
        "keywords": ["power", "violence", "authority", "force", "politics"],
        "aphorisms": [
          "Power arises wherever people act together.",
          "Violence can destroy power, but it can never create it.",
          "Authority is legitimate only when it is recognized, not imposed.",
          "Power is rooted in collective action, not in force.",
          "The reliance on violence betrays the decay of true power."
        ]
      },
      {
        "theme": "The Public and the Private",
        "keywords": ["public sphere", "private life", "politics", "freedom", "plurality"],
        "aphorisms": [
          "The private shelters life; the public gives it meaning.",
          "Without a public realm, freedom has no stage to appear.",
          "The public space is where words and deeds acquire reality.",
          "The rise of the social threatens the distinction between public and private.",
          "A people without a public space cannot remain free."
        ]
      },
      {
        "theme": "Natality and New Beginnings",
        "keywords": ["natality", "birth", "beginning", "hope", "future"],
        "aphorisms": [
          "The miracle that saves the world is the birth of new beings.",
          "Every beginning carries the promise of freedom.",
          "Natality is the foundation of politics, not mortality.",
          "To act is always to begin again.",
          "The future is safeguarded by the capacity to begin anew."
        ]
      },
      {
        "theme": "Truth and Politics",
        "keywords": ["truth", "politics", "lies", "reality", "facts"],
        "aphorisms": [
          "Facts are stubborn things, but they are fragile in politics.",
          "Lies are effective because they organize the multitude better than truth.",
          "Truth and politics have never been on friendly terms.",
          "The deliberate lie is a tool of domination.",
          "Reality itself is at stake when truth is abandoned."
        ]
      },
      {
        "theme": "Loneliness and Isolation",
        "keywords": ["loneliness", "isolation", "totalitarianism", "society", "alienation"],
        "aphorisms": [
          "Loneliness is the seedbed of totalitarianism.",
          "Isolation destroys political life; loneliness destroys the self.",
          "The lonely man loses the capacity for dialogue with himself.",
          "Totalitarian movements exploit the mass experience of loneliness.",
          "Only in plurality can loneliness be overcome."
        ]
      },
      {
        "theme": "Responsibility and Conscience",
        "keywords": ["responsibility", "conscience", "ethics", "judgment", "evil"],
        "aphorisms": [
          "Each man must answer for his deeds, even under orders.",
          "Obedience is not an excuse for injustice.",
          "To act without conscience is to cease being human.",
          "Moral responsibility cannot be delegated.",
          "Eichmann’s crime was not monstrous intent, but thoughtless compliance."
        ]
      },
      {
        "theme": "History and Memory",
        "keywords": ["history", "memory", "tradition", "past", "storytelling"],
        "aphorisms": [
          "History becomes human when it is told as a story.",
          "Memory preserves the thread of continuity in a broken world.",
          "Tradition both illuminates and burdens the present.",
          "The past is never dead; it shapes the horizon of the future.",
          "Storytelling redeems experience from the abyss of time."
        ]
      },
      {
        "theme": "Education and Culture",
        "keywords": ["education", "culture", "authority", "tradition", "future"],
        "aphorisms": [
          "Education is where we decide whether we love the world enough to assume responsibility for it.",
          "Culture stabilizes the world against the flux of time.",
          "Without tradition, education cannot transmit meaning.",
          "The task of education is to prepare newcomers for a world not of their making.",
          "To love the world is to cultivate and preserve it for the young."
        ]
      },
      {
        "theme": "Citizenship and Politics",
        "keywords": ["citizenship", "politics", "community", "freedom", "responsibility"],
        "aphorisms": [
          "To be a citizen is to share in the responsibility of the world.",
          "Politics is the space of appearance, not of rule.",
          "Citizenship is participation in speech and action.",
          "Freedom flourishes where citizens act together.",
          "Without citizens, politics collapses into administration."
        ]
      },
      {
        "theme": "Mortality and the Human Condition",
        "keywords": ["mortality", "human condition", "existence", "life", "death"],
        "aphorisms": [
          "Mortality shadows all human action, but natality redeems it.",
          "The condition of man is not only to die, but to begin.",
          "Life is lived between birth and death, but defined by beginnings.",
          "The finitude of man makes action meaningful.",
          "Death ends life, but not the story it leaves behind."
        ]
      }
    ]
  }
  