{
    "author": "Immanuel Kant",
    "category": "Aphorisms",
    "aphorisms": {
      "Reason and Understanding": [
        "Thoughts without content are empty; intuitions without concepts are blind.",
        "Reason is the faculty of principles.",
        "It is reason’s destiny to never rest until it reaches the unconditioned.",
        "Understanding makes nature possible, not the reverse.",
        "All our knowledge begins with experience, but not all of it arises from experience.",
        "The limits of our reason mark the limits of our knowledge.",
        "Reason must submit to critique if it is to avoid illusion.",
        "The concept of cause is a category imposed by the mind.",
        "We do not derive the laws of nature from nature, but impose them upon it.",
        "Experience is structured by the a priori forms of intuition—space and time."
      ],
      "Ethics and Morality": [
        "Act only according to that maxim whereby you can at the same time will that it should become a universal law.",
        "The moral law within me is a source of awe.",
        "Duty is the necessity of an action from respect for the law.",
        "Freedom is the condition of the moral law.",
        "To be moral is to be autonomous.",
        "Treat humanity, whether in your own person or in that of another, always as an end and never as a means only.",
        "Good will is the only thing that is good without qualification.",
        "Morality is not the doctrine of how we may make ourselves happy, but how we may become worthy of happiness.",
        "Every rational being exists as an end in himself.",
        "The kingdom of ends is a systematic union of rational beings through common laws."
      ],
      "Metaphysics and Epistemology": [
        "Metaphysics is the discipline that seeks knowledge independent of experience.",
        "All metaphysical knowledge must be subjected to critique.",
        "Transcendental idealism asserts that we know appearances, not things in themselves.",
        "Noumena are thinkable, but unknowable.",
        "Time and space are not things in themselves but forms of human sensibility.",
        "We bring unity to appearances through our synthetic a priori judgments.",
        "The antinomies of pure reason reveal the limits of speculative thought.",
        "Synthetic a priori judgments are the foundation of metaphysics.",
        "The understanding prescribes laws to nature.",
        "Kantian metaphysics begins where dogmatic metaphysics ends—with critique."
      ],
      "Freedom and Autonomy": [
        "Freedom is the ability to act according to a law one gives oneself.",
        "Autonomy is the ground of human dignity.",
        "Only a free will can be morally good.",
        "A heteronomous will is not truly moral.",
        "Freedom is not the license to do what one wants, but the power to act morally.",
        "A will that is free must act under the moral law.",
        "Without freedom, the moral law would be impossible.",
        "To be free is to obey reason.",
        "Moral obligation implies freedom of the will.",
        "Self-legislation is the highest expression of rational agency."
      ],
      "Aesthetics and Judgment": [
        "Beauty is the form of purposiveness without the representation of a purpose.",
        "The judgment of taste is not a judgment of cognition, but of feeling.",
        "The beautiful pleases universally without a concept.",
        "The sublime moves us through its overwhelming power or vastness.",
        "Art must be judged disinterestedly.",
        "Aesthetic judgment requires a free play between imagination and understanding.",
        "The genius gives the rule to art.",
        "Beauty is a symbol of moral goodness.",
        "The agreeable is personal, the beautiful is universal.",
        "We judge the beautiful as if everyone ought to agree."
      ],
      "Politics and Society": [
        "The only lawful constitution is one derived from the general will.",
        "Freedom is the sole original right belonging to every human being.",
        "The state exists to preserve the rights and dignity of persons.",
        "A republican constitution is the only one based on the principles of freedom.",
        "Peace must be established by reason, not by war.",
        "Cosmopolitan right is the right of a stranger not to be treated with hostility.",
        "Lying corrupts the dignity of humanity.",
        "Every human being is an end in themselves, not a means to another’s end.",
        "True politics must conform to morality.",
        "An enlightened public requires freedom of the press and thought."
      ],
      "Religion and Rational Faith": [
        "Religion is the recognition of all duties as divine commands.",
        "Morality leads inevitably to religion.",
        "We must postulate God, freedom, and immortality to make sense of moral experience.",
        "Faith is rational when it is moral.",
        "Religion within the bounds of reason is possible.",
        "God is not an object of theoretical reason but of practical faith.",
        "The moral law gives rise to the need for a highest good.",
        "Superstition is the corruption of moral religion.",
        "Hope is grounded in the moral order of the world.",
        "Reason cannot prove God, but it can make His postulation meaningful."
      ],
      "Human Nature and Anthropology": [
        "Out of the crooked timber of humanity, no straight thing was ever made.",
        "Man is an animal who needs a master.",
        "What is the human being? is the ultimate question of philosophy.",
        "The human being is both phenomenal and noumenal.",
        "We are destined to cultivate reason, even if through conflict.",
        "Enlightenment is man’s emergence from his self-imposed immaturity.",
        "Sapere aude!—Dare to know!",
        "Nature wills that man should develop all his faculties through his own effort.",
        "Man is the only being who must make a concept of himself before becoming himself.",
        "Man’s propensity to evil is real but not insurmountable."
      ],
      "Science and Knowledge": [
        "Science is possible only through the application of the understanding's categories to experience.",
        "Mathematics constructs its own concepts, while metaphysics analyzes them.",
        "Nature is not known through observation alone, but through the conditions of its possibility.",
        "The laws of nature are grounded in the structure of the mind.",
        "The understanding legislates nature.",
        "Knowledge grows through synthesis, not mere analysis.",
        "Science advances through critique, not dogma.",
        "Empirical knowledge must conform to the a priori structures of the mind.",
        "Causality is not discovered, but imposed.",
        "Even in science, reason must be self-critical."
      ]
    }
  }
  