{
    "author": "John Stuart Mill",
    "category": "Aphorisms",
    "aphorisms": {
      "Liberty and Individuality": [
        "The worth of a state in the long run is the worth of the individuals composing it.",
        "Genius can only breathe freely in an atmosphere of freedom.",
        "The only freedom which deserves the name is that of pursuing our own good in our own way.",
        "The liberty of the individual must be thus far limited; he must not make himself a nuisance to others.",
        "A person may rightfully be compelled to do or forbear only to prevent harm to others.",
        "Originality is the one thing which unoriginal minds cannot feel the use of.",
        "The despotism of custom is everywhere the standing hindrance to human advancement.",
        "The liberty of thought and discussion is essential to the pursuit of truth.",
        "The worth of a man manifests most when he is left to himself.",
        "Even opinions that are wrong may contain partial truths we have overlooked."
      ],
      "Utilitarianism and Ethics": [
        "The creed which accepts as the foundation of morals Utility, or the Greatest Happiness Principle, holds that actions are right in proportion as they promote happiness.",
        "Happiness is the only thing desirable as an end; all other things are desirable as means to that end.",
        "It is better to be a human being dissatisfied than a pig satisfied.",
        "The morality of an action depends on the consequences it produces.",
        "The essence of morality is to live so as to increase the sum of happiness in the world.",
        "Justice is a name for certain moral requirements which, regarded collectively, stand higher in the scale of social utility.",
        "All good things which exist are the fruits of originality.",
        "Virtue may be desired for its own sake, but only because it is a part of happiness.",
        "Conscience is the internal sanction of duty, derived from social feeling.",
        "Utility includes not only the pursuit of pleasure but the avoidance of pain."
      ],
      "Freedom of Speech and Thought": [
        "The peculiar evil of silencing the expression of an opinion is that it robs the human race.",
        "All silencing of discussion is an assumption of infallibility.",
        "Even a false opinion may have life-giving truth within it.",
        "The collision of adverse opinions helps the clearer perception of truth.",
        "The only way in which a human being can make some approach to knowing the whole of a subject is by hearing what can be said about it by persons of every variety of opinion.",
        "The truth which survives persecution is the one worth having.",
        "Discussion and criticism are the motors of intellectual progress.",
        "The best cure for bad speech is more speech.",
        "No opinion is worth holding if it cannot withstand criticism.",
        "Censorship is an admission of fear, not of strength."
      ],
      "Women and Gender Equality": [
        "The legal subordination of one sex to the other is wrong in itself.",
        "The principle which regulates the existing social relations between the two sexes is based on force.",
        "What is now called the nature of women is an eminently artificial thing.",
        "The only thing women have been systematically taught is submission.",
        "All causes, social and natural, combine to make it unlikely that women’s opinions should be heard freely.",
        "Genuine equality will not exist until the marriage contract is a partnership of equals.",
        "Women should be admitted to all social functions on equal terms with men.",
        "The liberty of women is inseparable from the liberty of all.",
        "Custom, not reason, is the great enemy of women's freedom.",
        "No great improvement in the lot of mankind is possible until the condition of women is improved."
      ],
      "Democracy and Government": [
        "The worth of a government is measured by its ability to foster the development of the people.",
        "A people who expect to be ignorant and free expect what never was and never will be.",
        "A state that dwarfs its men, in order that they may be more docile instruments in its hands, will find that with small men no great thing can be accomplished.",
        "The ideal of democracy is not simply majority rule but reasoned deliberation.",
        "The participation of the individual in political life is essential to the development of his faculties.",
        "A representative government is not good because it is efficient but because it trains the people in self-rule.",
        "The price of liberty is eternal vigilance.",
        "Government exists to protect people from harm, not from their own choices.",
        "No government can be perfect, but it can be just.",
        "Checks and balances are essential to guard against tyranny."
      ],
      "Education and Development": [
        "The worth of a soul is best tested by its capacity for self-culture.",
        "Genius is far more often crushed by neglect than developed by encouragement.",
        "A cultivated mind is the most noble possession of man.",
        "The education of the individual is a safeguard of liberty.",
        "The best teachers are those who can kindle the love of learning.",
        "Mental culture is a better safeguard of liberty than standing armies.",
        "No man is truly free who is not master of himself.",
        "Progress depends on the cultivation of intelligence and character.",
        "Education must aim not merely at knowledge but at self-development.",
        "An uncultivated intellect is vulnerable to dogma and manipulation."
      ],
      "Truth and Inquiry": [
        "The worth of a doctrine lies not in its popularity but in its capacity to survive challenge.",
        "Truth gains more by the errors of one who thinks for himself than by the correct opinions of those who follow blindly.",
        "Genius and originality are meaningless without freedom of inquiry.",
        "He who knows only his own side of the case knows little of that.",
        "The pursuit of truth is never served by conformity.",
        "Truth may suffer temporary eclipse, but it is never destroyed.",
        "The cause of liberty is the cause of truth.",
        "We must distrust dogmas, even when they are widely accepted.",
        "The spirit of improvement requires the spirit of questioning.",
        "Doubt is the beginning, not the end, of wisdom."
      ],
      "Human Progress and Civilization": [
        "The worth of a civilization is not in its material progress, but in the cultivation of moral and intellectual excellence.",
        "Civilization advances by the free use of reason and the liberty to act.",
        "The despotism of public opinion is as dangerous as that of a monarch.",
        "All good things which exist are the fruit of originality and individuality.",
        "The engine of progress is the free development of diverse opinions.",
        "Progress is only possible where the conditions for liberty and thought are protected.",
        "The test of civilization is the condition of the worst-off.",
        "The human race has always required dissenters to move forward.",
        "Conformity is the enemy of progress.",
        "A stagnant society is one where individuality is crushed."
      ],
      "Logic and Thought": [
        "Logic is the science of proof, not persuasion.",
        "The mind must be disciplined to think clearly and independently.",
        "Fallacies thrive where there is no cultivation of the intellect.",
        "Truth is reached through rigorous inquiry and doubt.",
        "No belief is above examination.",
        "Thinking clearly is more important than thinking quickly.",
        "All sound reasoning is essentially inductive.",
        "A false premise is the root of all intellectual error.",
        "Language is both a tool and a danger in reasoning.",
        "Clarity in thought leads to clarity in action."
      ]
    }
  }
  