{
    "author": "Ludwig Wittgenstein",
    "category": "Aphorisms",
    "aphorisms": {
      "Language and Meaning": [
        "The limits of my language mean the limits of my world.",
        "Language is a form of life.",
        "To understand a language is to master a technique.",
        "Words are like tools, not labels.",
        "The meaning of a word is its use in the language.",
        "Philosophical problems arise when language goes on holiday.",
        "A name means an object. The object is its meaning.",
        "The speaking of language is part of an activity, or of a form of life.",
        "Grammar tells what kind of object anything is.",
        "To imagine a language is to imagine a form of life."
      ],
      "Logic and Reality": [
        "The world is all that is the case.",
        "What can be shown cannot be said.",
        "The world is the totality of facts, not things.",
        "Whereof one cannot speak, thereof one must be silent.",
        "A proposition is a picture of reality.",
        "Logic must take care of itself.",
        "The limits of logic are the limits of the world.",
        "Propositions show the logical form of reality.",
        "That which expresses itself in language, we cannot express by means of language.",
        "A logical picture of facts is a thought."
      ],
      "Private Language and Subjectivity": [
        "There is no such thing as a private language.",
        "To follow a rule, we must already belong to a practice.",
        "You cannot whistle it to yourself, for even whistling would be a public act.",
        "Mental states cannot be described without public criteria.",
        "A private ostensive definition cannot fix the meaning of a word.",
        "Inner processes stand in need of outward criteria.",
        "Pain behavior is not a symptom of pain; it is part of the concept.",
        "We learn the meaning of ‘toothache’ through public behavior, not introspection.",
        "A sensation is not a something, but not a nothing either.",
        "If a lion could speak, we could not understand him."
      ],
      "Philosophy and Method": [
        "Philosophy is a battle against the bewitchment of our intelligence by means of language.",
        "Philosophy should leave everything as it is.",
        "The job of philosophy is to describe, not to explain.",
        "Philosophy is not a theory but an activity.",
        "Don’t think, look!",
        "The problems are dissolved in the clarification of language.",
        "Clarity is what we are aiming at.",
        "There is not a philosophical method, though there are indeed methods.",
        "Philosophy is not one of the natural sciences.",
        "All philosophy is a critique of language."
      ],
      "Rules and Games": [
        "To understand a rule is to be able to go on in the same way.",
        "Following a rule is a practice, not a matter of interpretation.",
        "Meaning is not fixed by a mental act, but by communal usage.",
        "Language games are varied as the lives we live.",
        "Agreement in form of life is prior to agreement in judgment.",
        "No course of action could be determined by a rule alone.",
        "A rule stands there like a sign-post, but it must still be interpreted.",
        "There is a way of grasping a rule that is not an interpretation.",
        "We do not always interpret rules, we often simply follow them.",
        "The application of a rule is not something separate from the rule."
      ],
      "Certainty and Doubt": [
        "A doubt that makes sense must rest on grounds for doubt.",
        "To doubt everything would be to doubt nothing.",
        "At the foundation of belief lies the bedrock of certainty.",
        "I act with certainty, not because I deduce, but because I belong to a practice.",
        "Some propositions stand fast for us.",
        "Doubt presupposes certainty.",
        "The difficulty is to realize the groundlessness of our believing.",
        "What stands fast does so not because it is justified, but because it is part of our practice.",
        "It is not a mistake to believe something where no doubt is possible.",
        "You must begin somewhere—so you begin with what is taken for granted."
      ],
      "Ethics and the Mystical": [
        "Ethics cannot be put into words.",
        "The sense of the world must lie outside the world.",
        "It is not how things are in the world that is mystical, but that it exists.",
        "God does not reveal himself in the world.",
        "The solution of the riddle of life in space and time lies outside space and time.",
        "What we cannot speak about we must pass over in silence.",
        "There are indeed things that cannot be put into words.",
        "The good life is the world seen sub specie aeterni.",
        "Values do not reside in the world, but in the eye that sees it.",
        "Aesthetic and ethical judgments transcend factual language."
      ],
      "Mind and Thought": [
        "Thinking is operating with signs.",
        "Understanding is not a mental process.",
        "The mind is not a container for thoughts.",
        "To think is to follow a rule implicitly.",
        "What goes on in your mind is expressed in how you act and speak.",
        "Belief is not a mental state but a way of acting and expecting.",
        "Meaning is not in the head.",
        "Thought requires external criteria to be meaningful.",
        "The grammar of mental terms is learned socially.",
        "There is no ghost in the machine."
      ],
      "Form of Life and Practice": [
        "Human agreement in judgments is grounded in agreement in form of life.",
        "Forms of life are the bedrock upon which language rests.",
        "A language game presupposes a human context.",
        "Our practices give meaning to our words.",
        "Nothing is more certain than the customs that guide us.",
        "Even logic belongs to a form of life.",
        "Philosophy does not explain our practices—it describes them.",
        "A language game is a snapshot of life in motion.",
        "The background of understanding is not knowledge, but doing.",
        "Words are rooted in human activity, not abstract systems."
      ],
      "Silence and the Unsayable": [
        "There are things that cannot be put into words—they make themselves manifest.",
        "What can be said at all can be said clearly.",
        "Whereof one cannot speak, thereof one must be silent.",
        "The mystical shows itself; it is not something we can talk about.",
        "Not everything that counts can be counted in propositions.",
        "The unsayable underlies the sayable.",
        "Ethics and aesthetics are one.",
        "The deepest problems are not solved but dissolved by silence.",
        "Language reaches its end at the borders of sense.",
        "We run up against the limits of language and fall silent."
      ]
    }
  }
  