{
    "author": "Martin Heidegger",
    "category": "Aphorisms",
    "aphorisms": {
      "Being and Ontology": [
        "The question of Being is the most fundamental question of philosophy.",
        "Being is not a being.",
        "The essence of Being is not itself a being.",
        "Being is always the Being of a being.",
        "We have forgotten the question of Being.",
        "Only a being that questions Being can understand Being.",
        "The ontological difference is the distinction between Being and beings.",
        "Being unfolds through the clearing of truth.",
        "The human being is the shepherd of Being.",
        "To think Being is to stand within the openness of its disclosure."
      ],
      "Dasein and Existence": [
        "Dasein is the being for whom Being is a question.",
        "Dasein always understands itself in terms of its possibilities.",
        "To exist is to project oneself upon possibilities.",
        "Dasein is always ahead of itself in its Being.",
        "Dasein is being-in-the-world.",
        "Care is the Being of Dasein.",
        "Dasein is essentially temporal.",
        "To be authentic is to own one's Being-toward-death.",
        "Dasein is thrown into the world and yet responsible for its choices.",
        "Being human means existing in a state of openness to Being."
      ],
      "Time and Temporality": [
        "Time is not a succession of moments but the horizon of Being.",
        "Temporality is the condition for the possibility of understanding Being.",
        "The past is not gone; it lives in the present as having-been.",
        "The future determines the meaning of the present and past.",
        "Dasein exists in a unity of future, past, and present.",
        "Being-toward-death opens the horizon of authentic temporality.",
        "Chronological time is secondary to existential temporality.",
        "The ecstases of time are the structures of existence.",
        "To exist is to stretch along time.",
        "Time is the house of Being."
      ],
      "Authenticity and Inauthenticity": [
        "Most people flee from themselves into the they-self.",
        "The they dictates how one is supposed to live.",
        "Authenticity means resolutely owning one's existence.",
        "To be authentic is to take up one's death as one’s own possibility.",
        "Falling is Dasein’s tendency to forget itself.",
        "The inauthentic self is absorbed in idle talk and distraction.",
        "Authenticity is not a constant state but a possibility to be grasped.",
        "Only in facing death can one truly own life.",
        "Authentic freedom arises from embracing one's thrownness.",
        "The call of conscience summons Dasein to itself."
      ],
      "Technology and Enframing": [
        "The essence of technology is not technological.",
        "Technology enframes the world as a standing reserve.",
        "Modern technology reveals beings only as resources to be used.",
        "Enframing obscures the truth of Being.",
        "We are challenged to think beyond the technological attitude.",
        "Technology is a way of revealing—but a dangerous one.",
        "Only a free relationship to technology can save us from it.",
        "The danger of technology is that it conceals its own essence.",
        "Art and poetry can reveal Being where technology conceals it.",
        "The saving power grows where the danger is greatest."
      ],
      "Language and Poetry": [
        "Language is the house of Being.",
        "Man dwells in language.",
        "Language speaks, not the human being.",
        "The essence of language is Saying as Showing.",
        "Poetry lets Being emerge into the light.",
        "Language is not merely a tool; it shapes our world.",
        "To think is to listen to the call of Being through language.",
        "The poet names the holy and the gods.",
        "Language reveals the world, and also conceals it.",
        "Thinking and poetry share the same essence."
      ],
      "Truth and Disclosure": [
        "Truth is aletheia—unconcealment.",
        "Truth is not correspondence but disclosure.",
        "To find truth is to stand in the clearing of Being.",
        "What is most thought-provoking is that we are still not thinking.",
        "Truth is the openness where beings can appear as they are.",
        "Thinking is letting Being be.",
        "Concealment is essential to the nature of truth.",
        "The truth of Being requires a readiness to listen.",
        "Philosophy begins in wonder at what is revealed.",
        "Truth is the clearing in which beings emerge."
      ],
      "Death and Finitude": [
        "Death is the most personal possibility of Dasein.",
        "Only in death does Dasein fully confront its own Being.",
        "Being-toward-death is the key to authentic existence.",
        "Death individualizes and personalizes Dasein.",
        "To live authentically is to anticipate one’s death.",
        "The awareness of death discloses the meaning of life.",
        "Death is not an event, but a mode of Being.",
        "Death calls Dasein back from the they.",
        "Only through death is freedom fully understood.",
        "In confronting death, we confront the mystery of Being itself."
      ],
      "Dwelling and Worldhood": [
        "Dwelling is the manner in which mortals exist on the earth.",
        "To build is to dwell.",
        "Dwelling is a poetic act.",
        "The world is not a thing but a horizon of meaning.",
        "The fourfold—earth, sky, mortals, and divinities—gather in dwelling.",
        "We do not inhabit space; we dwell poetically.",
        "World is formed through meaning, not matter.",
        "The thing gathers the world into presence.",
        "To dwell means to care and to preserve.",
        "The world is where beings show themselves in their truth."
      ],
      "Thinking and Philosophy": [
        "To think is to thank.",
        "Thinking is not calculating but letting be.",
        "Philosophy is not science; it is the recollection of Being.",
        "Great thinkers ask the unasked questions.",
        "Thinking must be a response to Being’s call.",
        "Metaphysics forgets the truth of Being.",
        "To think Being, one must abandon representational thinking.",
        "The essence of thinking is openness to what is.",
        "Thinking is a dialogue with Being.",
        "Philosophy begins where logic ends."
      ]
    }
  }