{
    "author": "Søren Kierkegaard",
    "category": "Aphorisms",
    "subject": [
      {
        "theme": "Anxiety and Despair",
        "keywords": [
          "Anxiety",
          "Despair",
          "freedom",
          "self",
          "danger",
          "life",
          "oneself",
          "sickness",
          "death",
          "endless"
        ],
        "aphorisms": [
          "Anxiety is the dizziness of freedom.",
          "Despair is not the loss of hope, but the loss of self.",
          "The greatest danger is not losing life, but losing oneself while still alive.",
          "Despair is the sickness unto death because it does not kill but festers endlessly.",
        "To be in despair is to refuse to be oneself before God."
        ]
      },
      {
        "theme": "Faith and the Absurd",
        "keywords": [
          "Faith",
          "Absurd",
          "reason",
          "inward",
          "passion",
          "knight",
          "faith",
          "righteousness",
          "risk"
        ],
        "aphorisms": [
          "Faith begins where reason ends.",
          "To have faith is to step out into the absurd with inward passion.",
          "The knight of faith leaps by virtue of the absurd, not of understanding.",
          "Abraham believed by virtue of the absurd, and it was reckoned to him as righteousness.",
          "Without risk, there is no faith."
        ]
      },
      {
      "theme": "Subjectivity and Truth",
      "keywords": [
        "Truth",
        "subjectivity",
        "inward",
        "objectivity",
        "science",
        "existence",
        "suffering",
        "truth"
      ],
      "aphorisms": [
        "Truth is subjectivity.",
        "To truly know a truth, one must live it inwardly.",
        "Objectivity belongs to science; inwardness belongs to existence.",
        "One does not arrive at truth by standing outside of it, but by suffering through it.",
        "To exist is to be in process, not in possession of final truths."
      ]
    },
    {
      "theme": "Stages of Life",
      "keywords": [
        "stages",
        "life",
        "aesthetic",
        "ethical",
        "despair",
        "leap",
        "faith",
        "eternal",
        "stage",
        "failure"
      ],
      "aphorisms": [
        "The aesthetic life seeks pleasure; the ethical life seeks responsibility.",
        "Despair is the consequence of the aesthetic life carried to its end.",
        "The leap to faith is not a progression, but a transformation.",
        "The ethical life demands the individual relate to the eternal.",
        "Each stage conceals the next within its failure."
      ]
    },
    {
      "theme": "Individuality and the Crowd",
      "keywords": [
        "Individuality",
        "Crowd",
        "untruth",
        "single",
        "individual",
        "God",
        "alone",
        "greatest",
        "task",
        "mediocrity"
      ],
      "aphorisms": [
        "The crowd is untruth.",
        "Truth can only be found in the single individual.",
        "He who stands before God must do so alone.",
        "To become oneself is the greatest task—and it must be done alone.",
        "The public is a phantom that levels everything down to mediocrity."
      ]
    },
    {
      "theme": "The Leap and Decision",
      "keywords": [
        "Decision",
        "existence",
        "delay",
        "becoming",
        "thinking",
        "choosing",
        "leap",
        "passionate",
        "resolve",
        "rational"
      ],
      "aphorisms": [
        "Decision is the highest expression of existence.",
        "To delay is to deny the truth of becoming.",
        "You become yourself not by thinking but by choosing.",
        "The leap is a passionate resolve, not a rational conclusion.",
        "To choose oneself is to choose in the presence of the eternal."
      ]
    },
    {
      "theme": "Love and Relationship",
      "keywords": [
        "love",
        "another",
        "eternal",
        "good",
        "feeling",
        "duty",
        "eternity",
        "romantic",
        "love",
        "God",
        "human",
        "love",
        "self-love"
      ],
      "aphorisms": [
        "To love another truly is to will their eternal good.",
        "Love is not a feeling, but a duty grounded in eternity.",
        "Romantic love begins in immediacy, but must become ethical to endure.",
        "To love God is the beginning of all true human love.",
        "Self-love must be broken before true love of others is possible."
      ]
    },
    {
      "theme": "Suffering and Redemption",
      "keywords": [
        "Suffering",
        "Redemption",
        "sorrow",
        "inwardness",
        "eternity",
        "good",
        "suffering",
        "eternal",
        "suffering",
        "redemption"
      ],
      "aphorisms": [
        "He who has learned to suffer has learned the most important thing.",
        "The deeper the sorrow, the closer to truth.",
        "Suffering is the school of inwardness.",
        "To suffer for the good is to stand before the eternal.",
        "Redemption is not escape from suffering, but transformation through it."
      ]
    },
    {
      "theme": "Irony and Humor",
      "keywords": [
        "Irony",
        "Humor",
        "philosophy",
        "end",
        "unchecked",
        "ironic",
        "person",
        "life",
        "enter",
        "faith",
        "absurdity",
        "pretending",
        "live",
        "inwardness"
      ],
      "aphorisms": [
        "Irony is the beginning of philosophy, but also its end if left unchecked.",
        "The ironic person stands apart from life, yet never truly enters it.",
        "Humor is the last stage before faith.",
        "Irony reveals the absurdity of pretending to live without inwardness.",
        "The ironist despairs behind a mask of detachment."
      ]
    },
    {
      "theme": "Time and Eternity",
      "keywords": [
        "Time",
        "eternity",
        "moment",
        "presence",
        "eternal",
        "moment",
        "God",
        "temporal",
        "pregnant",
        "eternal",
        "decision",
        "eternity"
      ],
      "aphorisms": [
        "The moment is where time and eternity touch.",
        "Eternity is not endless time, but timeless presence.",
        "To live eternally is to live fully in the moment with God.",
        "The temporal is always pregnant with the eternal—if one has the eyes to see.",
        "Every moment of true decision is an encounter with eternity."
      ]
    },
    {
      "theme": "Authenticity and Selfhood",
      "keywords": [
        "Authenticity",
        "Selfhood",
        "self",
        "achievement",
        "task",
        "God",
        "individual",
        "struggle",
        "comfort",
        "divine",
        "roles",
        "adopted"
      ],
      "aphorisms": [
        "To be a self is not a given, but an achievement.",
        "Becoming a self is a task given by God and answered by the individual.",
        "Authenticity is born in struggle, not comfort.",
        "The true self is found only in relation to the divine.",
        "Most people are not themselves, but roles they have adopted."
      ]
    },
    {
      "theme": "Christianity and Paradox",
      "keywords": [
        "Christianity",
        "Paradox",
        "doctrine",
        "existence",
        "God",
        "Christ",
        "absolute",
        "time",
        "finite",
        "suffering",
        "death",
        "self"
      ],
      "aphorisms": [
        "Christianity is not a doctrine, but existence before God.",
        "Christ is the absolute paradox: God in time, infinite in the finite.",
        "To follow Christ is to embrace suffering, not flee from it.",
        "The offense of Christianity is that it demands the death of the self.",
        "The Christian life is not about admiration, but imitation."
      ]
    },
    {
      "theme": "Guilt and Responsibility",
      "keywords": [
        "Guilt",
        "Responsibility",
        "self",
        "will",
        "God",
        "sin",
        "awakening",
        "freedom",
        "dread",
        "grace",
        "evade"
      ],
      "aphorisms": [
        "The self is guilty when it does not will to be itself before God.",
        "To recognize guilt is the first sign of awakening.",
        "Freedom brings responsibility—and with it, dread.",
        "Only the one who sees the weight of his sin can understand grace.",
        "To evade responsibility is to forfeit oneself."
      ]
    },
    {
      "theme": "Silence and Inwardness",
      "keywords": [
        "Silence",
        "Inwardness",
        "language",
        "stillness",
        "God",
        "noise",
        "world",
        "becoming",
        "silence",
        "inwardness"
      ],
      "aphorisms": [
        "Silence is the language of inwardness.",
        "In the stillness, the self hears the voice of God.",
        "The noise of the world drowns out the truth of becoming.",
        "He who cannot sit alone in silence cannot yet face himself.",
        "Inwardness is the sanctuary where decision is made."
      ]
    },
    {
      "theme": "Death and Eternity",
      "keywords": [
        "Death",
        "eternity",
        "end",
        "life",
        "absolute",
        "eternity",
        "moment",
        "God",
        "temporal",
        "pregnant",
        "eternal",
        "decision",
        "eternity"
      ],
      "aphorisms": [
        "To learn how to die is to learn how to live.",
        "Death brings clarity to the ambiguity of life.",
        "He who lives in relation to eternity is never unprepared for death.",
        "The temporal life is shaped by its confrontation with the eternal end.",
        "To die is not to end, but to stand before the Absolute."
      ]
    }
  ]
}
  