{
    "author": "Voltaire",
    "category": "Aphorisms",
    "subject": [
        {
            "theme": "Reason and Enlightenment",
            "keywords": ["reason", "enlightenment", "prejudice", "truth", "skepticism"],
            "aphorisms": [
          "Those who can make you believe absurdities can make you commit atrocities.",
          "To know who rules over you, find out whom you may not criticize.",
          "Judge a man by his questions rather than his answers.",
          "Reason is the light of the age; superstition is its darkness.",
          "Prejudice is opinion without judgment."
        ]
      },
      {
        "theme": "Freedom of Thought and Speech",
        "keywords": ["freedom", "speech", "expression", "liberty", "censorship"],
        "aphorisms": [
          "I disapprove of what you say, but I will defend to the death your right to say it.",
          "Liberty of thought is the life of the mind.",
          "Censorship is the confession of weak ideas.",
          "Free men speak freely; slaves repeat what they are told.",
          "A silenced truth is still a truth."
        ]
      },
      {
        "theme": "Religion and Superstition",
        "keywords": ["religion", "superstition", "fanaticism", "belief", "god"],
        "aphorisms": [
          "If God did not exist, it would be necessary to invent Him.",
          "Superstition is to religion what astrology is to astronomy.",
          "Fanaticism is more dangerous than tyranny.",
          "The more men understand, the less they fear devils and miracles.",
          "God is not served by cruelty, but by justice."
        ]
      },
      {
        "theme": "Tolerance and Humanity",
        "keywords": ["tolerance", "humanity", "compassion", "forgiveness", "justice"],
        "aphorisms": [
          "Tolerance is the consequence of humanity.",
          "We are all formed of frailty and error; let us pardon each other’s folly.",
          "It is not difference of opinion that kills, but intolerance.",
          "Every religion that persecutes is false.",
          "Compassion is the highest form of wisdom."
        ]
      },
      {
        "theme": "Society and Politics",
        "keywords": ["society", "politics", "power", "government", "inequality"],
        "aphorisms": [
          "History is the lie commonly agreed upon.",
          "Every man is guilty of all the good he did not do.",
          "The comfort of the rich rests on an abundance of the poor.",
          "The art of government consists in taking as much money as possible from one class to give to another.",
          "The best government is that which governs least."
        ]
      },
      {
        "theme": "War and Peace",
        "keywords": ["war", "peace", "violence", "tyranny", "conflict"],
        "aphorisms": [
          "It is forbidden to kill; therefore all murderers are punished, unless they kill in large numbers and to the sound of trumpets.",
          "Men use cannons to settle what reason could decide.",
          "War is the science of destroying men, politics of deceiving them.",
          "Every war leaves humanity poorer in virtue and richer in graves.",
          "Peace is the fruit of enlightened minds."
        ]
      },
      {
        "theme": "Human Nature",
        "keywords": ["human nature", "freedom", "ignorance", "reason", "weakness"],
        "aphorisms": [
          "Common sense is not so common.",
          "Man is free at the moment he wishes to be.",
          "Men argue; nature acts.",
          "Man is born weak and ignorant, but destined to reason.",
          "The more one judges, the less one understands."
        ]
      },
      {
        "theme": "Wealth and Poverty",
        "keywords": ["wealth", "poverty", "money", "greed", "class"],
        "aphorisms": [
          "When it is a question of money, everybody is of the same religion.",
          "The poor man is never free; necessity is his tyrant.",
          "Luxury corrupts nations as surely as idleness corrupts men.",
          "To be rich is to be feared, not to be admired.",
          "Greed is a passion that never sleeps."
        ]
      },
      {
        "theme": "Philosophy and Knowledge",
        "keywords": ["philosophy", "knowledge", "truth", "doubt", "wisdom"],
        "aphorisms": [
          "Doubt is not a pleasant condition, but certainty is absurd.",
          "The pursuit of truth is more valuable than its possession.",
          "Philosophy teaches us to doubt what we are told to believe.",
          "Ignorance is a disease that thrives in certainty.",
          "True wisdom lies in questioning everything."
        ]
      },
      {
        "theme": "Justice and Law",
        "keywords": ["justice", "law", "courts", "rights", "injustice"],
        "aphorisms": [
          "It is better to risk saving a guilty man than to condemn an innocent one.",
          "The law is often a spider’s web which catches the weak but lets the powerful break through.",
          "Justice delayed is injustice prolonged.",
          "A just law is the safeguard of liberty; an unjust law is tyranny.",
          "Courts should be temples of reason, not markets of power."
        ]
      },
      {
        "theme": "Work and Happiness",
        "keywords": ["work", "happiness", "virtue", "labor", "moderation"],
        "aphorisms": [
          "We must cultivate our garden.",
          "Work keeps us from three great evils: boredom, vice, and need.",
          "Happiness is a state of mind, not of possessions.",
          "The secret of being a bore is to tell everything.",
          "True happiness lies in moderation and reason."
        ]
      },
      {
        "theme": "Satire and Irony",
        "keywords": ["satire", "irony", "ridicule", "humor", "tyranny"],
        "aphorisms": [
          "Satire is the weapon of the powerless against folly.",
          "Ridicule is often the most effective argument.",
          "Irony is the smile of reason confronting absurdity.",
          "A jest reveals more truth than a sermon.",
          "Laughter disarms tyranny better than fear."
        ]
      },
      {
        "theme": "Education and Progress",
        "keywords": ["education", "progress", "learning", "enlightenment", "truth"],
        "aphorisms": [
          "Those who are enlightened must enlighten others.",
          "The more we learn, the less we fear.",
          "Education is the vaccine against superstition.",
          "Progress is the child of doubt and inquiry.",
          "The mind must be cultivated like a field, or it will grow weeds."
        ]
      },
      {
        "theme": "Fate and Providence",
        "keywords": ["fate", "chance", "providence", "destiny", "reason"],
        "aphorisms": [
          "Chance is a word void of meaning; nothing can exist without a cause.",
          "Each man shapes his fate as the gardener shapes his plants.",
          "Providence is often the name given to chance after it has happened.",
          "To resign to fate is to abdicate reason.",
          "The world is governed more by accident than by wisdom."
        ]
      },
      {
        "theme": "Mortality and Hope",
        "keywords": ["death", "mortality", "hope", "life", "immortality"],
        "aphorisms": [
          "It is not death that should be feared, but a wasted life.",
          "We are all travelers toward the same end, differing only in the path taken.",
          "Hope is the dream of the waking mind.",
          "Life is a shipwreck, but we must sing in the lifeboats.",
          "The memory of good deeds is the only immortality worth seeking."
        ]
      }
    ]
  }
  