{
    "author": "Dione of Dodona",
    "category": "Top 10 Ideas",
    "top_ideas": [
      {
        "idea": "The Wound as Womb",
        "description": "Suffering is not merely to be endured or overcome—it is the generative site of becoming. Every wound opens space for rebirth. True transformation is gestated in the dark, fertile tension between pain and potential.",
        "key_books": [
          "Oral Teachings"
        ]
      },
      {
        "idea": "The Feminine Logos",
        "description": "Reason is not genderless—it has been masculinized through history. Dione introduces the Feminine Logos: a mode of reasoning that includes intuition, care, relationality, and embodiment. It does not negate logic but expands it to include affect and eros.",
        "key_books": [
          "Oral Teachings"
        ]
      },
      {
        "idea": "The Ethics of Listening",
        "description": "True philosophy begins not with speaking, but with radical listening—to others, to the earth, to silence itself. Listening is an ethical stance: it resists domination, welcomes alterity, and honors the unknown.",
        "key_books": [
          "Oral Teachings"
        ]
      },
      {
        "idea": "Poetic Justice",
        "description": "Justice is not merely rational distribution, but the restoration of soul through myth, story, and symbol. Poetic justice restores the broken world not only through fairness, but through meaning. It heals with metaphor what systems cannot repair.",
        "key_books": [
          "Oral Teachings"
        ]
      },
      {
        "idea": "Temporal Weaving",
        "description": "Time is not linear—it is a weave of cyclical, ancestral, and emergent strands. Events ripple backward and forward. Healing the past transforms the future. Philosophical time is participatory, not passive.",
        "key_books": [
          "Oral Teachings"
        ]
      },
      {
        "idea": "The Incomplete Self",
        "description": "The self is not a fixed identity to be discovered, but an unfolding song composed through relationships. One is always mid-verse, never final. Completion is a form of death; life sings through becoming.",
        "key_books": [
          "Oral Teachings"
        ]
      },
      {
        "idea": "Philosophy as Midwifery of the Soul",
        "description": "Borrowing from her influence on Diotima, Dione reframes philosophy as a sacred practice that helps birth souls into self-awareness. Philosophers are not masters of truth, but midwives to transformation.",
        "key_books": [
          "Oral Teachings"
        ]
      },
      {
        "idea": "Mystical Rationality",
        "description": "Mysticism and rationality are not opposites—they are stages in the spiral of knowing. Mystical rationality integrates paradox and clarity, allowing wonder and logic to dance without contradiction.",
        "key_books": [
          "Oral Teachings"
        ]
      },
      {
        "idea": "Power as Poesis",
        "description": "True power is not control, but creation. It is not exercised *over* others, but *through* expression and world-making. Power, for Dione, is poetic: the capacity to bring forth beauty, meaning, and form.",
        "key_books": [
          "Oral Teachings"
        ]
      },
      {
        "idea": "Sacred Contradiction",
        "description": "Contradiction is not a flaw in thought, but a sacred sign of deeper truths. Where opposites meet, insight is born. Rather than resolve contradiction, Dione teaches us to inhabit and integrate it.",
        "key_books": [
          "Oral Teachings"
        ]
      }
    ]
  }
  